#ifndef TASK_H
#define TASK_H

#endif // TASK_H


/*Правила на играта:

Плочките с номера се редят в нарастващ ред, като се използва "дупката" за временно
преместване на плочките. Играта приключва, когато плочките са последователно
наредени, а "дупката" е в долния десен ъгъл.

Изисквания към играта:
1. Плочките са наредени произволно на дъската.
2. Плочките се местят, чрез клик върху тях.
3. Плочката може да бъде преместена само ако е до "дупката" (без диагонали).
4. Да се показва игрово време.
5. Да се показват броят на направените ходове.
6. Звуци:
    6.1. Звук при преместване на плочка.
    6.2. Звук за край на играта. С
